app/Controllers/User.php

SELECT *
FROM `usuarios`
WHERE `email` = 'donadmin@gmail.com'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
---
            } else {

                $model = new UsuarioModel();
                $user = $model->where('email', $this->request->getVar('email'))

SELECT *
FROM `usuarios`
WHERE `id` = '35'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
---
    public function mostrarPerfil()
    {

        $data = [];
        $model = new UsuarioModel();

        $data['user'] = $model->where('id', session()->get('id'))->first();

DELETE FROM `usuarios`
WHERE `id` = '21'
AND `id` IN ('21')
UPDATE `usuarios` SET `deleted_at` = '2022-12-22 14:34:06'
WHERE `id` = '24'
AND `id` IN ('24')
AND `deleted_at` IS NULL
---
    public function getBorrarusuario($idABorrar = null) {

        $modelo = model(UsuarioModel::class);

        $modelo->where('id', $idABorrar)->delete($idABorrar);