app/Models/UsuarioModel.php

    public function getUsuario($id = false)

    {

        if ($id === false) {

            return $this->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL