app/Models/ZooModel.php

SELECT *
FROM `zoos`
---
 public function getZoo($id = false)

    {

        if ($id === false) {

            return $this->findAll();